models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM "users" WHERE ("id"=13) AND ("status"=10)